tutorials/suspensionFoam/RAS/duneTransport/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type              groovyBC;
        variables       "tramp=10;Umean=0.6;";
        valueExpression   "(time()<=tramp) ? vector(Umean*(time()/tramp),0,0) : vector(Umean,0,0)";
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bed
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
